// Application information(Please translate)
/*
beatmania IIDX 20 tricoro のトランメダル管理アプリです。
基本的なメダル情報から、今日のイチオシ、ライバル挑戦状、DJ POINTのメダル獲得状況、獲得枚数を管理することができます！
さらに右上の灼熱くんボタンを押せばまだ獲得していないトランメダル一覧を一発表示！
アプリ内でデータ管理を行うため、一切の通信は行わずリアルタイムで素早くチェックすることができます。
もちろんKONAMI IDの入力も不要です。
今度のイベントでのメダル獲得状況にも対応予定！

※翻訳にご協力ください！
以下に言語設定ファイルがありますので、修正していただければ対応版をリリースします。
http://kaibadash.github.com/tranmedal_localize/
*/

/*
This application manages Tran Medal in beatmania IIDX 20 tricoro.
It can manage basic medal information, rival information and DJ point, etc.
You tap Sun button, it can show only medals which you don't have.
There is medal data in application, so it doesn't use internet connection.
I will update application if new event comes!

If you need this application in your language,
please send "push request" or e-mail to me, then I'll update it.
http://kaibadash.github.com/tranmedal_localize/
*/

// common
"はい" = "Yes";
"いいえ" = "No";
"キャンセル" = "Cancel";
"完了" = "Complete";

// words(upper)
"段位認定" = "GRADE";
"行脚" = "TRAVEL";

// messages
"アプリのデータを初期化します。取得済みメダルは初期化しません。" = "Do you initialize application data? I don't delete your medal data which you got.";
"アプリを初期化し、インストール時の状態に戻します。取得済みメダルデータも削除されるのでご注意ください。" = "Do you reset applicaton? Be careful I delete your medal data which you got.";
"アプリ不調時にお試しください。" = "Try this if applicaton does't work.";
"インストール時の状態に戻します。" = "Reset application.";
"データクリア" = "Clear data.";
"データ初期化" = "Initialize data.";
"バージョン情報" = "Version";
"ライブラリ" = "Library";
"初期化" = "Initialize";
"データ初期化中" = "Initializing";
"全データ初期化中" = "Initializing";
"サポート" = "Support";
"不具合を報告" = "Report bugs";
"英語か日本語のみ受付けています" = "English or Japanese only";
"AppStoreで評価" = "Rate at AppStore";
"高評価いただけると幸いです" = "Please give me good rate!";

// Feedback
"AAMFeedbackTitle" = "Feedback";
"AAMFeedbackTopicsTitle" = "Topics";
"AAMFeedbackButtonMail" = "Mail";
"AAMFeedbackDescriptionPlaceholder" = "Please write for details.";
"AAMFeedbackTableHeaderTopics" = "Please Fill";
"AAMFeedbackTableHeaderBasicInfo" = "Your Environment";
"AAMFeedbackTopicsQuestion" = "Question";
"AAMFeedbackTopicsRequest" = "Request";
"AAMFeedbackTopicsBugReport" = "Bug Report";
"AAMFeedbackTopicsMedia" = "Media";
"AAMFeedbackTopicsBusiness" = "Business";
"AAMFeedbackTopicsOther" = "Other";
"AAMFeedbackMailDidFinishWithError" = "Failed to send your feedback. Please try later.";

// medal data
"今日のイチオシ" = "TOPIC";
"ライバル挑戦状" = "RIVAL";
"DJ POINT" = "DJ POINT";
"初プレイ" = "FIRST PLAY";
"NORMAL譜面初プレイ" = "NORMAL FIRST PLAY";
"HYPER譜面初プレイ" = "HYPER FIRST PLAY";
"ANOTHER譜面初プレイ" = "ANOTHER FIRST PLAY";
"4月" = "April";
"5月" = "May";
"6月" = "June";
"7月" = "July";
"8月" = "August";
"9月" = "September";
"10月" = "October";
"11月" = "November";
"12月" = "December";
"1月" = "January";
"2月" = "February";
"3月" = "March";
"終業" = "Closing";
"卒業" = "Graduation";
"合格" = "Success";
"アストランの輝き" = "Shine of Aztlan";
"ボス撃破" = "Boss";

// medal data:sub menu
"1年生" = "First";
"2年生" = "Second";
"3年生" = "Third";
"七級" = "Seventh class";
"六級" = "Sixth class";
"五級" = "Fifth class";
"四級" = "Fourth class";
"三級" = "Third class";
"二級" = "Second class";
"一級" = "First class";
"初段" = "First rank";
"二段" = "Second rank";
"三段" = "Third rank";
"四段" = "Fourth rank";
"五段" = "Fifth rank";
"六段" = "Sixth rank";
"七段" = "Seventh rank";
"八段" = "Eighth rank";
"九段" = "Ninth rank";
"十段" = "Tenth rank";
"皆伝" = "Master rank";

// =============== END OF TRANSLATE ==================

"CLEAR" = "CLEAR";
"DJ LEVEL" = "DJ LEVEL";
"LEGEND CROSS" = "LEGEND CROSS";
"LEGEND CROSS RED" = "LEGEND CROSS RED";
"SERIES" = "SERIES";
"STEP UP" = "STEP UP";
"SUPPORT" = "SUPPORT";
"Etc" = "Etc";

// medal data (don't need translate)
"HARD CLEAR" = "HARD CLEAR";
"EX HARD CLEAR" = "EX HARD CLEAR";
"FULL COMBO CLEAR" = "FULL COMBO CLEAR";
"A" ="A";
"AA" ="AA";
"AAA" ="AAA";

// medal data:sub menu (don't need translate)
"☆1" = "☆1";
"☆2" = "☆2";
"☆3" = "☆3";
"☆4" = "☆4";
"☆5" = "☆5";
"☆6" = "☆6";
"☆7" = "☆7";
"☆8" = "☆8";
"☆9" = "☆9";
"☆10" = "☆10";
"☆11" = "☆11";
"☆12" = "☆12";
"1st" = "1st";
"2nd" = "2nd";
"3rd" = "3rd";
"4th" = "4th";
"5th" = "5th";
"6th" = "6th";
"7th" = "7th";
"8th" = "8th";
"9th" = "9th";
"10th" = "10th";
"11th RED" = "11th RED";
"12th HAPPY SKY" = "12th HAPPY SKY";
"13th Distorted" = "13th Distorted";
"14th GOLD" = "14th GOLD";
"15th DJ TROOPERS" = "15th DJ TROOPERS";
"16th EMPRESS" = "16th EMPRESS";
"17th SIRIUS" = "17th SIRIUS";
"18th Resort Anthem" = "18th Resort Anthem";
"19th Lincle" = "19th Lincle";
"20th tricoro" = "20th tricoro";
"北海道" = "Hokkaido";
"青森" = "Aomori";
"秋田" = "Akita";
"岩手" = "Iwate";
"山形" = "Yamagata";
"宮城" = "Miyagi";
"福島" = "Fukushima";
"栃木" = "Tochigi";
"群馬" = "Gunma";
"茨城" = "Ibaraki";
"埼玉" = "Saitama";
"東京" = "Tokyo";
"千葉" = "Chiba";
"神奈川" = "Kanagawa";
"新潟" = "Niigata";
"長野" = "Nagano";
"山梨" = "Yamanashi";
"静岡" = "Shizuoka";
"富山" = "Toyama";
"石川" = "Ishikawa";
"福井" = "Fukui";
"岐阜" = "Gifu";
"愛知" = "Aichi";
"三重" = "Mie";
"滋賀" = "Saga";
"奈良" = "Nara";
"京都" = "Kyoto";
"大阪" = "Osaka";
"和歌山" = "Wakayama";
"兵庫" = "Hyogo";
"鳥取" = "Tottori";
"島根" = "Shimane";
"岡山" = "Okayama";
"広島" = "Hiroshima";
"山口" = "Yamaguchi";
"香川" = "Kagawa";
"徳島" = "Tokushima";
"愛媛" = "Ehime";
"高知" = "Kouchi";
"福岡" = "Hukuoka";
"佐賀" = "Saga";
"長崎" = "Nagasaki";
"大分" = "Oita";
"熊本" = "Kumamoto";
"宮崎" = "Miyazaki";
"鹿児島" = "Kagoshima";
"沖縄" = "Okinawa";
"北海道制覇" = "Complete Hokkaido";
"東北制覇" = "Complete Tohoku";
"関東制覇" = "Complete Kanto";
"中部制覇" = "Complete Chubu";
"近畿制覇" = "Complete Kinki";
"中国制覇" = "Complete Chugoku";
"四国制覇" = "Complete Shikoku";
"九州制覇" = "Complete Kyusyu";
"沖縄制覇" = "Complete Okinawa";
"全国制覇" = "Complete All";
"1-N" = "1-N";
"2-N" = "2-N";
"3-N" = "3-N";
"4-N" = "4-N";
"5-N" = "5-N";
"6-N" = "6-N";
"7-N" = "7-N";
"8-N" = "8-N";
"9-N" = "9-N";
"10-N" = "10-N";
"11-N" = "11-N";
"12-N" = "12-N";
"1-H" = "1-H";
"2-H" = "2-H";
"3-H" = "3-H";
"4-H" = "4-H";
"5-H" = "5-H";
"6-H" = "6-H";
"7-H" = "7-H";
"8-H" = "8-H";
"9-H" = "9-H";
"10-H" = "10-H";
"11-H" = "11-H";
"12-H" = "12-H";
"1-A" = "1-A";
"2-A" = "2-A";
"3-A" = "3-A";
"4-A" = "4-A";
"5-A" = "5-A";
"6-A" = "6-A";
"7-A" = "7-A";
"8-A" = "8-A";
"9-A" = "9-A";
"10-A" = "10-A";
"11-A" = "11-A";
"12-A" = "12-A";